SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_synth.h
/* Bit fields for SYNTH DSMCTRLTX */
#define _SYNTH_DSMCTRLTX_RESETVALUE                   0x00000013UL                                      /**< Default value for SYNTH_DSMCTRLTX           */
#define _SYNTH_DSMCTRLTX_MASK                         0x070003FFUL                                      /**< Mask for SYNTH_DSMCTRLTX                    */
#define SYNTH_DSMCTRLTX_DITHERDSMINPUTTX              (0x1UL << 0)                                      /**< Dithering of DSM input for TX mode          */
#define _SYNTH_DSMCTRLTX_DITHERDSMINPUTTX_SHIFT       0                                                 /**< Shift value for SYNTH_DITHERDSMINPUTTX      */
#define _SYNTH_DSMCTRLTX_DITHERDSMINPUTTX_MASK        0x1UL                                             /**< Bit mask for SYNTH_DITHERDSMINPUTTX         */
#define _SYNTH_DSMCTRLTX_DITHERDSMINPUTTX_DEFAULT     0x00000001UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define SYNTH_DSMCTRLTX_DITHERDSMINPUTTX_DEFAULT      (_SYNTH_DSMCTRLTX_DITHERDSMINPUTTX_DEFAULT << 0)  /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define _SYNTH_DSMCTRLTX_DITHERDSMOUTPUTTX_SHIFT      1                                                 /**< Shift value for SYNTH_DITHERDSMOUTPUTTX     */
#define _SYNTH_DSMCTRLTX_DITHERDSMOUTPUTTX_MASK       0xEUL                                             /**< Bit mask for SYNTH_DITHERDSMOUTPUTTX        */
#define _SYNTH_DSMCTRLTX_DITHERDSMOUTPUTTX_DEFAULT    0x00000001UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define SYNTH_DSMCTRLTX_DITHERDSMOUTPUTTX_DEFAULT     (_SYNTH_DSMCTRLTX_DITHERDSMOUTPUTTX_DEFAULT << 1) /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define _SYNTH_DSMCTRLTX_DITHERDACTX_SHIFT            4                                                 /**< Shift value for SYNTH_DITHERDACTX           */
#define _SYNTH_DSMCTRLTX_DITHERDACTX_MASK             0xF0UL                                            /**< Bit mask for SYNTH_DITHERDACTX              */
#define _SYNTH_DSMCTRLTX_DITHERDACTX_DEFAULT          0x00000001UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define SYNTH_DSMCTRLTX_DITHERDACTX_DEFAULT           (_SYNTH_DSMCTRLTX_DITHERDACTX_DEFAULT << 4)       /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_DSMMODETX                     (0x1UL << 8)                                      /**< Delta-sigma topology for TX mode            */
#define _SYNTH_DSMCTRLTX_DSMMODETX_SHIFT              8                                                 /**< Shift value for SYNTH_DSMMODETX             */
#define _SYNTH_DSMCTRLTX_DSMMODETX_MASK               0x100UL                                           /**< Bit mask for SYNTH_DSMMODETX                */
#define _SYNTH_DSMCTRLTX_DSMMODETX_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define _SYNTH_DSMCTRLTX_DSMMODETX_FEEDFORWARD        0x00000000UL                                      /**< Mode FEEDFORWARD for SYNTH_DSMCTRLTX        */
#define _SYNTH_DSMCTRLTX_DSMMODETX_MASH               0x00000001UL                                      /**< Mode MASH for SYNTH_DSMCTRLTX               */
#define SYNTH_DSMCTRLTX_DSMMODETX_DEFAULT             (_SYNTH_DSMCTRLTX_DSMMODETX_DEFAULT << 8)         /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_DSMMODETX_FEEDFORWARD         (_SYNTH_DSMCTRLTX_DSMMODETX_FEEDFORWARD << 8)     /**< Shifted mode FEEDFORWARD for SYNTH_DSMCTRLTX*/
#define SYNTH_DSMCTRLTX_DSMMODETX_MASH                (_SYNTH_DSMCTRLTX_DSMMODETX_MASH << 8)            /**< Shifted mode MASH for SYNTH_DSMCTRLTX       */
#define SYNTH_DSMCTRLTX_LSBFORCETX                    (0x1UL << 9)                                      /**< Delta-sigma input force LSB for TX mode     */
#define _SYNTH_DSMCTRLTX_LSBFORCETX_SHIFT             9                                                 /**< Shift value for SYNTH_LSBFORCETX            */
#define _SYNTH_DSMCTRLTX_LSBFORCETX_MASK              0x200UL                                           /**< Bit mask for SYNTH_LSBFORCETX               */
#define _SYNTH_DSMCTRLTX_LSBFORCETX_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define SYNTH_DSMCTRLTX_LSBFORCETX_DEFAULT            (_SYNTH_DSMCTRLTX_LSBFORCETX_DEFAULT << 9)        /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_DEMMODETX                     (0x1UL << 24)                                     /**< DEM Mode for TX mode                        */
#define _SYNTH_DSMCTRLTX_DEMMODETX_SHIFT              24                                                /**< Shift value for SYNTH_DEMMODETX             */
#define _SYNTH_DSMCTRLTX_DEMMODETX_MASK               0x1000000UL                                       /**< Bit mask for SYNTH_DEMMODETX                */
#define _SYNTH_DSMCTRLTX_DEMMODETX_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define _SYNTH_DSMCTRLTX_DEMMODETX_DISABLED           0x00000000UL                                      /**< Mode DISABLED for SYNTH_DSMCTRLTX           */
#define _SYNTH_DSMCTRLTX_DEMMODETX_ENABLED            0x00000001UL                                      /**< Mode ENABLED for SYNTH_DSMCTRLTX            */
#define SYNTH_DSMCTRLTX_DEMMODETX_DEFAULT             (_SYNTH_DSMCTRLTX_DEMMODETX_DEFAULT << 24)        /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_DEMMODETX_DISABLED            (_SYNTH_DSMCTRLTX_DEMMODETX_DISABLED << 24)       /**< Shifted mode DISABLED for SYNTH_DSMCTRLTX   */
#define SYNTH_DSMCTRLTX_DEMMODETX_ENABLED             (_SYNTH_DSMCTRLTX_DEMMODETX_ENABLED << 24)        /**< Shifted mode ENABLED for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_MASHORDERTX                   (0x1UL << 25)                                     /**< MASH order for TX mode                      */
#define _SYNTH_DSMCTRLTX_MASHORDERTX_SHIFT            25                                                /**< Shift value for SYNTH_MASHORDERTX           */
#define _SYNTH_DSMCTRLTX_MASHORDERTX_MASK             0x2000000UL                                       /**< Bit mask for SYNTH_MASHORDERTX              */
#define _SYNTH_DSMCTRLTX_MASHORDERTX_DEFAULT          0x00000000UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define _SYNTH_DSMCTRLTX_MASHORDERTX_SECOND           0x00000000UL                                      /**< Mode SECOND for SYNTH_DSMCTRLTX             */
#define _SYNTH_DSMCTRLTX_MASHORDERTX_THIRD            0x00000001UL                                      /**< Mode THIRD for SYNTH_DSMCTRLTX              */
#define SYNTH_DSMCTRLTX_MASHORDERTX_DEFAULT           (_SYNTH_DSMCTRLTX_MASHORDERTX_DEFAULT << 25)      /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_MASHORDERTX_SECOND            (_SYNTH_DSMCTRLTX_MASHORDERTX_SECOND << 25)       /**< Shifted mode SECOND for SYNTH_DSMCTRLTX     */
#define SYNTH_DSMCTRLTX_MASHORDERTX_THIRD             (_SYNTH_DSMCTRLTX_MASHORDERTX_THIRD << 25)        /**< Shifted mode THIRD for SYNTH_DSMCTRLTX      */
#define SYNTH_DSMCTRLTX_REQORDERTX                    (0x1UL << 26)                                     /**< ReQuant order for TX mode                   */
#define _SYNTH_DSMCTRLTX_REQORDERTX_SHIFT             26                                                /**< Shift value for SYNTH_REQORDERTX            */
#define _SYNTH_DSMCTRLTX_REQORDERTX_MASK              0x4000000UL                                       /**< Bit mask for SYNTH_REQORDERTX               */
#define _SYNTH_DSMCTRLTX_REQORDERTX_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for SYNTH_DSMCTRLTX            */
#define _SYNTH_DSMCTRLTX_REQORDERTX_FIRST             0x00000000UL                                      /**< Mode FIRST for SYNTH_DSMCTRLTX              */
#define _SYNTH_DSMCTRLTX_REQORDERTX_SECOND            0x00000001UL                                      /**< Mode SECOND for SYNTH_DSMCTRLTX             */
#define SYNTH_DSMCTRLTX_REQORDERTX_DEFAULT            (_SYNTH_DSMCTRLTX_REQORDERTX_DEFAULT << 26)       /**< Shifted mode DEFAULT for SYNTH_DSMCTRLTX    */
#define SYNTH_DSMCTRLTX_REQORDERTX_FIRST              (_SYNTH_DSMCTRLTX_REQORDERTX_FIRST << 26)         /**< Shifted mode FIRST for SYNTH_DSMCTRLTX      */
#define SYNTH_DSMCTRLTX_REQORDERTX_SECOND             (_SYNTH_DSMCTRLTX_REQORDERTX_SECOND << 26)        /**< Shifted mode SECOND for SYNTH_DSMCTRLTX     */

